#include <iostream>
#include "factorialR.h"
using namespace std;
//Раздел 5.1, Глава 5. Рекурсия и деревья

int main()
{
    cout << "Compute factorial of number: ";
    int N = 1;
    cin >> N;
    //---------------------------------------------------------------------------------------------
    //факториал
    int fact = 1;
    for(int i = 1; i <= N; i++) fact *= i;
    //---------------------------------------------------------------------------------------------
    cout << "Factorial of " << N << " : " << fact << endl;
    //---------------------------------------------------------------------------------------------
    //факториал рекурсивный
    int factR = factorialR(N);
    //---------------------------------------------------------------------------------------------
    cout << "Factorial recursive of " << N << " : " << factR << endl;
    //---------------------------------------------------------------------------------------------
    system("pause");
    return 0;
}
